//Задача 47. Задайте двумерный массив размером m×n, заполненный случайными вещественными числами.

//m = 3, n = 4.
//0,5 7 -2 -0,2
//1 -3,3 8 -9,9
//8 7,8 -7,1 9

using System;

class Program
{
    static void Main()
    {
        // Размеры массива
        int m = 3;
        int n = 4;

        // Создаем генератор случайных чисел
        Random random = new Random();

        // Создаем двумерный массив с размерами m x n
        double[,] двумерныйМассив = new double[m, n];

        // Заполняем массив случайными вещественными числами
        for (int i = 0; i < m; i++)
        {
            for (int j = 0; j < n; j++)
            {
                // Генерируем случайное вещественное число от -10 до 10
                double случайноеЧисло = random.NextDouble() * 20 - 10;
                двумерныйМассив[i, j] = случайноеЧисло;
            }
        }

        // Выводим массив на экран
        Console.WriteLine("Случайно заполненный двумерный массив:");
        for (int i = 0; i < m; i++)
        {
            for (int j = 0; j < n; j++)
            {
                Console.Write(двумерныйМассив[i, j] + "\t");
            }
            Console.WriteLine();
        }
    }
}



//Задача 52. Задайте двумерный массив из целых чисел. Найдите среднее арифметическое элементов в каждом столбце.

//Например, задан массив:
//1 4 7 2
//5 9 2 3
//8 4 2 4
//Среднее арифметическое каждого столбца: 4,6; 5,6; 3,6; 3.



using System;

class Program
{
    static void Main()
    {
        // Задаем двумерный массив
        int[,] массив = {
            {1, 4, 7, 2},
            {5, 9, 2, 3},
            {8, 4, 2, 4}
        };

        int количествоСтрок = массив.GetLength(0);
        int количествоСтолбцов = массив.GetLength(1);

        // Создаем массив для хранения средних значений столбцов
        double[] средниеЗначенияСтолбцов = new double[количествоСтолбцов];

        // Находим средние значения для каждого столбца
        for (int j = 0; j < количествоСтолбцов; j++)
        {
            int сумма = 0;

            for (int i = 0; i < количествоСтрок; i++)
            {
                сумма += массив[i, j];
            }

            средниеЗначенияСтолбцов[j] = (double)сумма / количествоСтрок;
        }

        // Выводим средние значения столбцов
        Console.WriteLine("Средние значения столбцов:");

        for (int j = 0; j < количествоСтолбцов; j++)
        {
            Console.WriteLine("Столбец " + (j + 1) + ": " + средниеЗначенияСтолбцов[j]);
        }
    }
}